code-review/NRB_3471_3546/База_Было/Catalogs/РазделыСчетаДепо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>РазделыСчетаДепо</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.СчетаДепо</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВходящийНомерПоручения</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗакрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОткрытияСчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Залогодержатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийКодНРД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияОткрытияСчета</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ОткрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСчетаДепоМХ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РазделыСчетаДепоМХ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусСчетаДепо</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыСчетовДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипРазделаСчетаДЕПО</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыРазделовСчетовДЕПО</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделСубклиента</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Субклиент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Субклиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперацияЗакрытияРаздела</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗакрытиеРазделаСчетаДепо</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписаниеПоПредписаниюБР</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Брокер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

code-review/NRB_3471_3546/База_Было/Catalogs/РазделыСчетаДепо/Ext/ObjectModule.bsl
#Область ОписаниеПеременных

// Хранит значения реквизитов для Kafka перед записью текущего состояния
Перем ИсходноеСостояние;
Перем ИсходноеСостояниеУникальныхПолей; // Реквизиты, которые воспринимаются как новый объект для BQ
#КонецОбласти

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если Перечисления.ТипыСчетовДепо.НоминальныхДержателей().Найти(Владелец.ТипСчетаДепо) <> Неопределено Тогда
		Если РазделСубклиента Тогда
			ПроверяемыеРеквизиты.Добавить("Субклиент");
		ИначеЕсли ЗначениеЗаполнено(Субклиент) И Не РазделСубклиента Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не установлен флаг ""Раздел субклиента"" при заполненном поле ""Субклиент""");
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Клиент = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Владелец, "Владелец");
	Если Справочники.Контрагенты.ЯвляетсяКонтрагентом(Клиент) Тогда
		ПроверяемыеРеквизиты.Удалить(ПроверяемыеРеквизиты.Найти("РазделСчетаДепоМХ"));
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ)

	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если Перечисления.ТипыСчетовДепо.НоминальныхДержателей().Найти(Владелец.ТипСчетаДепо) = Неопределено Тогда
		Если РазделСубклиента Или ЗначениеЗаполнено(Субклиент) Тогда
			Сообщение = "Ошибка при сохранении раздела " + СокрЛП(Код) + " счета ДЕПО " + СокрЛП(Владелец.Код)
			+ ": заполнение реквизитов полей ""Раздел субклиента"" и ""Субклиент"" разрешено только для Счетов ДЕПО номинального держателя!";
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Сообщение);
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;

	Если ПустаяСтрока(Наименование) Тогда
		Наименование = НаименованиеРазделаСчетаДепо();
	КонецЕсли;
	
	СостояниеРаздела = ИсходноеСостояниеРаздела();
	ИсходноеСостояние = СостояниеРаздела.СтруктураРаздела;
	ИсходноеСостояниеУникальныхПолей = СостояниеРаздела.СтруктураУникальныхПолей;
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеРаздела = ДанныеВыгрузки();
	ДобавленИлиУдален = ИсходноеСостояние.ЭтоНовый Или ПометкаУдаления;
	// Осторожно, при изменении реквизитов к выгрузке не проверяется изменение реквизита DepoAccountType. Это ошибка или так и надо
	// понять не удалось (выявлено при доработке).
	НужноОтправлятьСообщениеВДругиеСистемы = ДобавленИлиУдален Или ИзменилисьРеквизитыКВыгрузке(ДанныеРаздела, ИсходноеСостояние);
	Если НужноОтправлятьСообщениеВДругиеСистемы Тогда
		ТекстОшибки = "";
		Если КлючевыеПоляЗаполнены(ДанныеРаздела, ТекстОшибки) Тогда
			СтруктураСообщения = НовыйРазделСчетаДляKafka(ДанныеРаздела);
			ТекстJSON = РаботаСJSON.ТекстСообщенияJSON(СтруктураСообщения.MessageInfo, СтруктураСообщения.Data);
			ВнешнийИсточник = ПланыВидовХарактеристик.ВнешниеИсточники.KafkaClientResponse;
			Кафка.ПоместитьСообщениеВРегистрКОтправке(ВнешнийИсточник, "AccountDepo", ТекстJSON, , Ссылка);
		Иначе
			ТекстОшибки = "Информация о добавлении/изменении раздела счета ДЕПО не будет отправлена в другие системы,"
							+ " так как не заполнена вся необходимая информация о разделе: " + ТекстОшибки;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
		КонецЕсли;
	Иначе
		Если Не ДобавленИлиУдален Тогда
			НужноОтправлятьСообщениеВIT = ИзменилисьРеквизитыКВыгрузке(ДанныеРаздела, ИсходноеСостояниеУникальныхПолей);
			Если НужноОтправлятьСообщениеВIT Тогда
				ШаблонПредупреждения = "По счету изменили ключевые параметры [было\стало]: Номер счета [%1 \ %3], Раздел счета [%2 \ %4])";
				ТекстПредупреждения = СтрШаблон(ШаблонПредупреждения,
					СокрЛП(ИсходноеСостояниеУникальныхПолей.DepoNumber), СокрЛП(ИсходноеСостояниеУникальныхПолей.Code),
					ДанныеРаздела.DepoNumber, ДанныеРаздела.Code);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупреждения);
				ТемаПисьма = " Уведомление о смене ключевых параметров раздела счета депо";
				ВнешнийИсточникIT = ПланыВидовХарактеристик.ВнешниеИсточники.РассылкаУведомленийОСменеНомераСчетаДепоИлиНомераРазделаСчетаДепо;
				ТелоПисьма = "Внимание!" + Символы.ПС + Символы.ПС;
				СообщенияQI.ОтправитьСлужебноеУведомление(ВнешнийИсточникIT, ТемаПисьма, ТелоПисьма + ТекстПредупреждения);
			Иначе
				ТекстОшибки = "Информация об изменении раздела счета ДЕПО не будет отправлена в другие системы,"
								+ " так как ключевая информация о разделе не изменилась";
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки);
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

Функция КлючевыеПоляЗаполнены(ДанныеРаздела, ТекстОшибки)
	СписокОбязательныхПолей = "Status,CrmClientId,DepoNumber,Code,DepoMxDivisionCode,DepoMxFactCode";
	ПроверятьЗаполненность = Истина;
	РаботаСJSON.ПроверитьОбязательныеПоля(ДанныеРаздела, СписокОбязательныхПолей, ТекстОшибки, ПроверятьЗаполненность);
	КлючевыеПоляЗаполнены = ПустаяСтрока(ТекстОшибки);
	
	Возврат КлючевыеПоляЗаполнены;
КонецФункции

Функция ДанныеВыгрузки()
	
	Депонент = Владелец.Владелец;
	ФизЛицо = Депонент.ЮридическиеФизическиеЛица;
	КодЗагрузкиКлиента = Обработки.РегистрацияКлиентаЧерезKafka.CrmClientId(ФизЛицо);
	ДоговорДепонента = ДоговорДепонента();
	AccountDepo = Новый Структура;
	AccountDepo.Вставить("ObjectVersion", ИсторияДанныхВызовСервера.КоличествоВерсийОбъекта(Ссылка) + 1);
	AccountDepo.Вставить("Status", ?(РазделСчетаОткрыт(), "REG", "CLOSED"));
	AccountDepo.Вставить("CrmClientId", СокрЛП(КодЗагрузкиКлиента));
	AccountDepo.Вставить("DepoAccountType", Перечисления.ТипыРазделовСчетовДЕПО.ТипРазделаСчетаДляKafka(ТипРазделаСчетаДЕПО));
	AccountDepo.Вставить("DateStart", ДатаОткрытияСчета);
	AccountDepo.Вставить("DateEnd", ДатаЗакрытияСчета);
	AccountDepo.Вставить("DepoNumber", СокрЛП(Владелец.Код));
	AccountDepo.Вставить("Code", СокрЛП(Код));
	AccountDepo.Вставить("DepoContrctNum", СокрЛП(ДоговорДепонента.Код));
	AccountDepo.Вставить("DepoContractDate", ДоговорДепонента.ДатаНачалоДействия);
	AccountDepo.Вставить("DepoMxFactCode", СокрЛП(РазделСчетаДепоМХ.Владелец.Код));
	AccountDepo.Вставить("DepoMxDivisionCode", СокрЛП(РазделСчетаДепоМХ.Код));
	
	Возврат AccountDepo;
	
КонецФункции

Функция НовыйРазделСчетаДляKafka(СтруктураСообщения)
	
	MessageInfo = ОбменДаннымиКафка.ДанныеMessageInfo();
	MessageInfo.MessageType = "AccountDepo";
	Если ИсходноеСостояние.ЭтоНовый Тогда
		MessageInfo.ActionType = "INS";
	ИначеЕсли ПометкаУдаления Тогда
		MessageInfo.ActionType = "DEL";
	Иначе
		MessageInfo.ActionType = "UPD";
	КонецЕсли;
	MessageInfo.JsonVersion = "1.0.0";
	
	СтруктураСообщения.DateEnd = РаботаСJSON.ПредставлениеПустойДатыJSON(СтруктураСообщения.DateEnd);
	СтруктураСообщения.DateStart = РаботаСJSON.ПредставлениеПустойДатыJSON(СтруктураСообщения.DateStart);
	
	Ответ = Новый Структура("MessageInfo,Data", MessageInfo, СтруктураСообщения);
	Возврат Ответ;

КонецФункции

Функция ИзменилисьРеквизитыКВыгрузке(ТекущиеДанные, ПроверяемыеРеквизиты)
	Для Каждого Реквизит Из ПроверяемыеРеквизиты Цикл
		Если ТипЗнч(Реквизит.Значение) = Тип("Строка") И Не (СокрЛП(Реквизит.Значение) = СокрЛП(ТекущиеДанные[Реквизит.Ключ])) Тогда
			Возврат Истина;
		ИначеЕсли ТипЗнч(Реквизит.Значение) = Тип("Дата") И Не (Реквизит.Значение = ТекущиеДанные[Реквизит.Ключ]) Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	Возврат Ложь;
КонецФункции

Функция ИсходноеСостояниеРаздела()
	СтруктураРаздела = ПустаяСтруктураРаздела();
	СтруктураУникальныхПолей = ПустаяСтруктураУникальныхПолей();
	Если Не ЭтоНовый() Тогда
		Запрос = Новый Запрос(
		"ВЫБРАТЬ
		|	ЛОЖЬ КАК ЭтоНовый,
		|	РазделыСчетаДепо.Код КАК Code,
		|	РазделыСчетаДепо.ДатаОткрытияСчета КАК DateStart,
		|	РазделыСчетаДепо.ДатаЗакрытияСчета КАК DateEnd,
		|	РазделыСчетаДепо.Владелец.Код КАК DepoNumber,
		|	РазделыСчетаДепо.РазделСчетаДепоМХ.Код КАК DepoMxDivisionCode,
		|	РазделыСчетаДепо.РазделСчетаДепоМХ.Владелец.Код КАК DepoMxFactCode,
		|	РазделыСчетаДепо.ТипРазделаСчетаДЕПО КАК DepoAccountType
		|ИЗ
		|	Справочник.РазделыСчетаДепо КАК РазделыСчетаДепо
		|ГДЕ
		|	РазделыСчетаДепо.Ссылка = &Ссылка");
		Запрос.УстановитьПараметр("Ссылка", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			ЗаполнитьЗначенияСвойств(СтруктураРаздела, Выборка);
			ЗаполнитьЗначенияСвойств(СтруктураУникальныхПолей, Выборка);
		КонецЕсли;
	КонецЕсли;
	Результат = Новый Структура("СтруктураРаздела, СтруктураУникальныхПолей", СтруктураРаздела, СтруктураУникальныхПолей);
	Возврат Результат;
КонецФункции

Функция ПустаяСтруктураРаздела()
	Возврат Новый Структура("ЭтоНовый,DepoMxDivisionCode,DepoMxFactCode,DepoAccountType,DateEnd,DateStart",
								Истина);	
КонецФункции

Функция ПустаяСтруктураУникальныхПолей()
	Возврат Новый Структура("ЭтоНовый, Code, DepoNumber", Истина);
КонецФункции

Функция ДоговорДепонента()
	
	Запрос = Новый Запрос(
	"ВЫБРАТЬ
	|	ДоговорыКонтрагентов.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|ГДЕ
	|	НЕ ДоговорыКонтрагентов.ПометкаУдаления
	|	И ДоговорыКонтрагентов.Владелец = &Владелец");
	Запрос.УстановитьПараметр("Владелец", Владелец.Владелец);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Ссылка;
	Иначе
		Возврат Справочники.ДоговорыКонтрагентов.ПустаяСсылка();
	КонецЕсли;
КонецФункции

Функция РазделСчетаОткрыт()
	Возврат НЕ ПометкаУдаления И (НЕ ЗначениеЗаполнено(ДатаЗакрытияСчета) ИЛИ ДатаЗакрытияСчета > ТекущаяДатаСеанса());
КонецФункции

Функция НаименованиеРазделаСчетаДепо() Экспорт
	ДатаДокументаОткрытия = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ОперацияОткрытияСчета, "Дата");
	Наименование = Справочники.РазделыСчетаДепо.НаименованиеРазделаСчетаДепоПоТипу(
		ТипРазделаСчетаДЕПО, Залогодержатель, ДатаДокументаОткрытия);
	Возврат Наименование;
КонецФункции
